[[["c9c2c750-ba7a-4a11-9c0f-d4d12e08a488",{"pageContent":"“The Apex Dream” – A WWE Journey\nI remember the moment everything changed.\n\nI was ten years old, sitting on the floor of my living room with my eyes locked on the screen. The Viper, Randy Orton, stood atop the turnbuckle, arms outstretched, the arena basking in his legacy. He had just dropped someone with a thunderous RKO, and I swear the impact shook me through the television. I pointed at the screen and whispered, “One day… I’m gonna beat him.”","metadata":{"source":"./public/wwe-text.txt","loc":{"lines":{"from":1,"to":4}}}}],["5dda131b-9365-4035-974b-71b25119ffd9",{"pageContent":"Nobody took it seriously. Not my friends, not even my family. I was just a scrawny kid from a small town where dreams were more like bedtime stories than goals. But that night planted something in me—a fire I couldn’t put out.","metadata":{"source":"./public/wwe-text.txt","loc":{"lines":{"from":6,"to":6}}}}],["aef10b1a-487d-4da4-ba98-b1a1d268fa05",{"pageContent":"The Grind Begins\nFast forward ten years. I’m flipping burgers at a local joint during the day, training at a run-down wrestling school at night. No AC, barely padded mats, and a coach who believed in tough love more than encouragement. I didn’t care. I’d take every bump, every bruise, and still ask for more.","metadata":{"source":"./public/wwe-text.txt","loc":{"lines":{"from":8,"to":9}}}}],["1d04ff53-6d47-4b2c-993c-5522393c026d",{"pageContent":"I worked indie shows for gas money, wrestling in bingo halls and gymnasiums. Sometimes five people showed up. Sometimes just two. I drove hundreds of miles to perform for a handshake and a hot dog. But I kept at it. I studied tape, mimicked Orton’s timing, his poise, but made sure to build my own identity—my own legend.","metadata":{"source":"./public/wwe-text.txt","loc":{"lines":{"from":11,"to":11}}}}],["b516bac9-aa0b-49fa-95db-3fbc1f7153da",{"pageContent":"Getting the Call\nAfter a brutal triple-threat match in the middle of nowhere, I got backstage and checked my phone. A WWE scout had been watching. Said I had “the look, the hunger, and the heart.” I got an invite to the Performance Center tryout. I didn’t sleep that night.\n\nThe tryout was hell. Cardio drills that made my lungs feel like they were on fire. Chain wrestling that pushed my body past its limits. But I was ready. I wasn’t the biggest or the flashiest, but I was the most relentless.","metadata":{"source":"./public/wwe-text.txt","loc":{"lines":{"from":13,"to":16}}}}],["8e84b5ec-7221-4768-a75f-c64663c6f1a5",{"pageContent":"A week later, I got the call: “Welcome to WWE.”\n\nClimbing the Mountain\nNXT was no cakewalk. I was surrounded by world-class athletes, and every match felt like survival. I lost more than I won at first. Got concussed, dislocated a shoulder. People doubted me, said I didn’t have it. But every time I walked through the curtain, I thought about that moment when I was ten.","metadata":{"source":"./public/wwe-text.txt","loc":{"lines":{"from":18,"to":21}}}}],["f0a7e46f-d856-4ad3-a97d-7a5fbb1c78b3",{"pageContent":"I rose the ranks, match by match. The crowd started to feel it too. They saw the fire. I wasn’t just another guy trying to be a star—I was becoming one.\n\nAfter two years in NXT, I got called up to the main roster. First match on RAW? A battle royal. I lasted until the final four. My first storyline? Midcard grind. But I kept my head down and gave it everything.\n\nThen came the big break: the Royal Rumble.","metadata":{"source":"./public/wwe-text.txt","loc":{"lines":{"from":23,"to":27}}}}],["8f7f13af-ed70-44e5-8146-55d5584e47f0",{"pageContent":"Then came the big break: the Royal Rumble.\n\nThe Rumble Moment\nI entered at number 7. I stayed in for nearly 40 minutes. Then the buzzer hit—number 29. Randy Orton. The crowd exploded. My heart nearly burst. We locked eyes. He nodded. Respect. Then, like a switch flipped, he RKO’d me.\n\nBut I wasn’t done.","metadata":{"source":"./public/wwe-text.txt","loc":{"lines":{"from":27,"to":32}}}}],["2ba6ad4d-ea3f-4485-a213-e4590ad31ca0",{"pageContent":"But I wasn’t done.\n\nI crawled back up, blood in my mouth, sweat pouring down, and I eliminated two others. It came down to me and Orton. The place was electric. After a vicious exchange, I ducked a second RKO and tossed him over the top rope.\n\nI didn’t win the Rumble, but I eliminated him. The message was sent: I was coming.","metadata":{"source":"./public/wwe-text.txt","loc":{"lines":{"from":32,"to":36}}}}],["627a3fef-4520-4c6c-a592-f54517666dee",{"pageContent":"The Road to WrestleMania\nI started gaining momentum. Wins over big names. A few promos that went viral. The fans started chanting my name louder. I was on fire. Then, the impossible happened—Randy Orton returned from an injury and challenged me.\n\n“WrestleMania. Day 2. Main event. You say I’m your idol? Prove you’ve surpassed me.”\n\nI signed the contract with a smile.","metadata":{"source":"./public/wwe-text.txt","loc":{"lines":{"from":38,"to":43}}}}],["ca124f73-2cff-4204-86d4-515061c2039a",{"pageContent":"I signed the contract with a smile.\n\nWrestleMania – The Apex Moment\nThe stadium was deafening. The lights dimmed. My entrance hit, a mix of raw energy and the journey behind me. Then came Orton—slow, composed, venomous.\n\nThe bell rang.\n\nIt was a war. Not a match. 30 minutes of mind games, counters, and pain. I hit him with everything—superkicks, power moves, submission attempts. He kept kicking out. Then he caught me with an RKO from nowhere. I barely got my shoulder up at two.","metadata":{"source":"./public/wwe-text.txt","loc":{"lines":{"from":43,"to":50}}}}],["945244fb-0e37-40b4-abde-283269f80819",{"pageContent":"The crowd lost their minds.\n\nThen, I did it. After faking a feint and countering a second RKO, I hit my own finisher—a move I created—the Apex Driver. One. Two. Three.\n\nThe crowd exploded. I rolled off him, tears in my eyes. The ref raised my hand, and I looked out at 80,000 people chanting my name. Orton stood up slowly, looked me dead in the eye… and offered a handshake.\n\nI took it.\n\nFull circle.","metadata":{"source":"./public/wwe-text.txt","loc":{"lines":{"from":52,"to":60}}}}],["d815c6d7-bbd6-49b5-905f-384ad6a38704",{"pageContent":"I took it.\n\nFull circle.\n\nEpilogue: More Than a Win\nThat match didn’t just make me a star. It made me a symbol. Of perseverance. Of heart. Of never giving up on a childhood dream—even when the world tells you it’s impossible.\n\nBeating Randy Orton at WrestleMania wasn’t just a win.\n\nIt was the beginning… of my legacy.","metadata":{"source":"./public/wwe-text.txt","loc":{"lines":{"from":58,"to":67}}}}]],{"0":"c9c2c750-ba7a-4a11-9c0f-d4d12e08a488","1":"5dda131b-9365-4035-974b-71b25119ffd9","2":"aef10b1a-487d-4da4-ba98-b1a1d268fa05","3":"1d04ff53-6d47-4b2c-993c-5522393c026d","4":"b516bac9-aa0b-49fa-95db-3fbc1f7153da","5":"8e84b5ec-7221-4768-a75f-c64663c6f1a5","6":"f0a7e46f-d856-4ad3-a97d-7a5fbb1c78b3","7":"8f7f13af-ed70-44e5-8146-55d5584e47f0","8":"2ba6ad4d-ea3f-4485-a213-e4590ad31ca0","9":"627a3fef-4520-4c6c-a592-f54517666dee","10":"ca124f73-2cff-4204-86d4-515061c2039a","11":"945244fb-0e37-40b4-abde-283269f80819","12":"d815c6d7-bbd6-49b5-905f-384ad6a38704"}]